IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f2838x_cm_systick_regs.xml
<module id="SYSTICK" HW_revision="" description="SYSTICK Registers">
	<register id="SYST_CSR" width="32" page="1" offset="0x10" internal="0" description="Privileged a SysTick Control and Status Register">
		<bitfield id="ENABLE" description="Enables the counter" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="TICKINT" description="Enables SysTick exception request" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CLKSOURCE" description="Indicates the clock source" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="COUNTFLAG" description="timer counted to 0 since last read." begin="16" end="16" width="1" rwaccess="RW"/>
	</register>
	<register id="SYST_RVR" width="32" page="1" offset="0x14" internal="0" description="Privileged Unknown SysTick Reload Value Register">
		<bitfield id="RELOAD" description="Counter reload value" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="SYST_CVR" width="32" page="1" offset="0x18" internal="0" description="Privileged Unknown SysTick Current Value Register">
		<bitfield id="CURRENT" description="Current counter value" begin="23" end="0" width="24" rwaccess="RW"/>
	</register>
	<register id="SYST_CALIB" width="32" page="1" offset="0x1c" internal="0" description="Privileged -a SysTick Calibration Value Register">
		<bitfield id="TENMS" description="Current counter value" begin="23" end="0" width="24" rwaccess="RW"/>
		<bitfield id="SKEW" description="Indicates whether the TENMS value is exact" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="NOREF" description="Device provides a reference clock to the processor" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
</module>
